Repository: kyiashkoievgen/HardStudy
Catalog: web/translations/*/LC_MESSAGES/messages.po
Languages: es, pt

source: Использование всех чувств в процессе обучения значительно улучшает способность к запоминанию. Сочетание визуальных, аудиовизуальных и тактильных методов обучения обеспечивает глубокое погружение в языковую среду, что усиливает и ускоряет процесс запоминания новой информации.
es: El uso de todos los sentidos en el proceso de aprendizaje mejora significativamente la capacidad de memorización. La combinación de métodos visuales, audiovisuales y táctiles garantiza una inmersión profunda en el entorno lingüístico, lo que potencia y acelera el proceso de memorización de nueva información.
pt: O uso de todos os sentidos no processo de aprendizagem melhora significativamente a capacidade de memorização. A combinação de métodos visuais, audiovisuais e táteis de ensino proporciona uma imersão profunda no ambiente linguístico, o que intensifica e acelera o processo de memorização de novas informações.

source: Развитие навыка слепой печати
es: Desarrollo de la habilidad de mecanografía a ciegas.
pt: Desenvolvimento da habilidade de digitação cega.

source: С Study Forge вы не только изучаете новый язык, но и одновременно развиваете навык слепой печати. Этот уникальный подход не только повышает вашу эффективность работы с текстами, но и способствует более глубокому запоминанию изучаемого материала благодаря активизации моторных навыков.
es: Con Study Forge no solo aprendes un nuevo idioma, sino que también desarrollas simultáneamente la habilidad de escribir a ciegas. Este enfoque único no solo mejora tu eficiencia al trabajar con textos, sino que también promueve una memorización más profunda del material de estudio gracias a la activación de habilidades motoras.
pt: Com o Study Forge, não só você aprende um novo idioma, mas também desenvolve simultaneamente a habilidade de digitação cega. Esta abordagem única não apenas aumenta a sua eficiência no trabalho com textos, mas também promove uma memorização mais profunda do material estudado, graças à ativação das habilidades motoras.

source: Инновационная мотивационная система
es: Sistema de motivación innovadora
pt: Sistema motivacional inovador

source: Наша мотивационная система, включающая физическую стимуляцию, никотиновые награды и финансовые поощрения, стимулирует продолжение обучения даже в моменты, когда мотивация может ослабевать. Эта система создает дополнительные стимулы для обучения и помогает достигать лучших результатов.
es: Nuestro sistema de motivación, que incluye estimulación física, recompensas de nicotina y incentivos financieros, fomenta la continuación del aprendizaje incluso en momentos en que la motivación pueda debilitarse. Este sistema crea estímulos adicionales para el aprendizaje y ayuda a lograr mejores resultados.
pt: Nosso sistema de motivação, que inclui estimulação física, recompensas de nicotina e incentivos financeiros, estimula a continuação do aprendizado mesmo nos momentos em que a motivação pode enfraquecer. Este sistema cria estímulos adicionais para o aprendizado e ajuda a alcançar melhores resultados.

source: Адаптивность к индивидуальным потребностям
es: Adaptabilidad a las necesidades individuales.
pt: Adaptabilidade às necessidades individuais

source: Study Forge гибко адаптируется к вашим индивидуальным потребностям и уровню знаний, предлагая персонализированный подход к обучению. Благодаря этому каждый ученик может продвигаться в своем темпе, достигая оптимальных результатов.
es: Study Forge se adapta de manera flexible a tus necesidades individuales y nivel de conocimientos, ofreciendo un enfoque personalizado para el aprendizaje. Gracias a esto, cada estudiante puede avanzar a su propio ritmo, alcanzando resultados óptimos.
pt: O Study Forge se adapta flexivelmente às suas necessidades individuais e nível de conhecimento, oferecendo uma abordagem personalizada para o aprendizado. Isso permite que cada aluno avance em seu próprio ritmo, alcançando resultados ótimos.

source: Выбирая Study Forge, вы выбираете методику, которая не только обучает, но и вдохновляет, мотивирует и поддерживает вас на каждом этапе пути к знаниям. Присоединяйтесь к нам и откройте для себя новый мир обучения, где каждый урок — это шаг к успеху.
es: Al elegir Study Forge, estás eligiendo una metodología que no solo enseña, sino que también inspira, motiva y te apoya en cada etapa del camino hacia el conocimiento. Únete a nosotros y descubre un nuevo mundo de aprendizaje, donde cada lección es un paso hacia el éxito.
pt: Ao escolher o Study Forge, você está escolhendo uma metodologia que não apenas ensina, mas também inspira, motiva e apoia você em cada etapa do caminho para o conhecimento. Junte-se a nós e descubra um novo mundo de aprendizado, onde cada lição é um passo em direção ao sucesso.

source: Начало обучения с Study Forge
es: Inicio del aprendizaje con Study Forge.
pt: Início do aprendizado com o Study Forge.

source: Присоединиться к Study Forge и начать изучение нового языка проще, чем кажется. Следуйте этим простым шагам, чтобы начать свое путешествие в мир языков и программирования сегодня:
es: Únete a Study Forge y comienza a aprender un nuevo idioma es más fácil de lo que parece. Sigue estos simples pasos para comenzar tu viaje en el mundo de los idiomas y la programación hoy:
pt: Junte-se ao Study Forge e começar a aprender um novo idioma é mais fácil do que parece. Siga estes simples passos para começar sua jornada no mundo das línguas e da programação hoje:

source: Шаг 1: Регистрация
es: Paso 1: Registro
pt: Passo 1: Registro

source: Нажмите на кнопку «Регистрация». Заполните необходимую информацию, включая ваше имя, электронную почту. Не забудьте подтвердить свою учетную запись через ссылку, отправленную на вашу электронную почту.
es: Presione el botón "Registro". Complete la información necesaria, incluyendo su nombre, correo electrónico. No olvide confirmar su cuenta a través del enlace enviado a su correo electrónico.
pt: Clique no botão "Registro". Preencha as informações necessárias, incluindo seu nome, e-mail. Não se esqueça de confirmar sua conta através do link enviado para o seu e-mail.

source: Шаг 2: Выбор языка и уровня сложности
es: Paso 2: Selección del idioma y nivel de dificultad
pt: Passo 2: Escolha o idioma e o nível de dificuldade.

source: После регистрации и входа в систему выберите язык выбрав пункт меню "Уроки", который хотите изучать. Мы предлагаем обучение с нуля до продвинутого уровня.
es: Después de registrarte e iniciar sesión en el sistema, elige el idioma seleccionando la opción "Lecciones" que deseas estudiar. Ofrecemos enseñanza desde cero hasta un nivel avanzado.
pt: Depois de se registrar e fazer login no sistema, selecione o idioma escolhendo a opção "Lições" no menu, que deseja estudar. Nós oferecemos treinamento do nível iniciante ao avançado.

source: Шаг 3: Настройка системы поощрений и наказаний
es: Paso 3: Configuración del sistema de recompensas y castigos.
pt: Passo 3: Configuração do sistema de recompensas e punições.

source: Настройте свои предпочтения для получения наград и определите, какие стимулы наиболее эффективны для вас. Для этого войдите в настройки и выберете нужный мотиватор. Обратите внимание, что чем больше мотиваторов тем эффективней обучение
es: Ajusta tus preferencias para recibir recompensas y determina qué estímulos son más efectivos para ti. Para hacerlo, entra en la configuración y elige el motivador adecuado. Ten en cuenta que cuantos más motivadores haya, más efectivo será el aprendizaje.
pt: Ajuste suas preferências para receber recompensas e determine quais estímulos são mais eficazes para você. Para fazer isso, acesse as configurações e escolha o motivador adequado. Observe que quanto mais motivadores, mais eficaz será o aprendizado.

source: На данный момент методика находиться на стадии разработки по вопросам мотивирующих устройств пишите
es: En este momento, la metodología se encuentra en la etapa de desarrollo en cuanto a cuestiones de dispositivos motivadores. Por favor, escriban.
pt: Atualmente, o método está em fase de desenvolvimento em relação aos dispositivos motivacionais. Por favor, escreva.

source: Шаг 4: Начало первого урока
es: Paso 4: Comienzo de la primera lección
pt: Passo 4: Início da primeira aula

source: Нажмите пункт меню "Учить", чтобы начать свой первый урок. Каждый урок в Study Forge разработан так, чтобы максимально задействовать все ваши чувства для лучшего запоминания и понимания материала.
es: Presiona la opción "Aprender" en el menú para comenzar tu primera lección. Cada lección en Study Forge está diseñada para involucrar al máximo todos tus sentidos para una mejor memorización y comprensión del material.
pt: Clique no item de menu "Aprender" para começar sua primeira aula. Cada aula no Study Forge é projetada para envolver ao máximo todos os seus sentidos para uma melhor memorização e compreensão do material.

source: Следуя этим шагам, вы легко начнете свое обучение и сможете в полной мере воспользоваться всеми преимуществами методики Study Forge. Добро пожаловать в сообщество учащихся, которые выбрали эффективный и инновационный подход к изучению языков!
es: Siguiendo estos pasos, comenzarás fácilmente tu aprendizaje y podrás aprovechar al máximo todas las ventajas de la metodología Study Forge. ¡Bienvenido a la comunidad de estudiantes que han elegido un enfoque eficaz e innovador para el aprendizaje de idiomas!
pt: Seguindo esses passos, você começará facilmente seus estudos e poderá aproveitar ao máximo todas as vantagens da metodologia Study Forge. Bem-vindo à comunidade de estudantes que escolheram uma abordagem eficaz e inovadora para o aprendizado de idiomas!

source: Дом
es: Casa
pt: Casa

source: Настройки
es: Ajustes
pt: Configurações

source: Уроки
es: Lecciones
pt: Aulas

source: Выбран урок:
es: Clase seleccionada:
pt: Aula selecionada:

source: Учить
es: Aprender
pt: Aprender

source: Чат
es: Chat
pt: Chat

source: Статистика
es: Estadística
pt: Estatística

source: Выйти
es: Salir
pt: Sair

source: Создать
es: Crear
pt: Criar

source: Изучаемый язык
es: El idioma estudiado
pt: Língua estudada

source: Показано раз
es: Mostrado ahora
pt: Mostrado agora

source: Правильных ответов
es: Respuestas correctas
pt: Respostas corretas

source: Ответов без подсказок
es: Respuestas sin pistas
pt: Respostas sem dicas

source: Последний раз показано
es: La última vez mostrado
pt: Última vez exibido

source: Включено в обучение
es: Incluido en la formación
pt: Incluído na formação

source: Баланс мотиватора
es: Equilibrio del motivador
pt: Equilíbrio do motivador

source: Внимание!!! После активации какие либо изменения внести будет не возможно, пока не закончится его действие.
es: ¡Atención! Una vez activado, no se podrán realizar cambios hasta que finalice su efecto.
pt: Atenção!!! Após a ativação, não será possível fazer quaisquer alterações até que a sua ação termine.

source: Активировать мотиватор
es: Activar el motivador.
pt: Ativar o motivador.

source: Пополните баланс для активации мотиватора
es: Recargue el saldo para activar el motivador.
pt: Recarregue o saldo para ativar o motivador.

source: Пополнить
es: Recargar
pt: Recarregar

source: Баланс
es: Equilibrio
pt: O equilíbrio

source: Вывести
es: Sacar
pt: Exibir

source: День
es: Día
pt: Dia

source: осталось
es: quedó
pt: restou

source: часов что бы пройти уроки
es: horas para completar las lecciones
pt: horas para passar as aulas

source: Перекур
es: Pausa para fumar
pt: Pausa para fumar

source: Устройство подключено
es: El dispositivo está conectado.
pt: O dispositivo está conectado

source: Показано
es: Mostrado
pt: Mostrado

source: Потрачено времени
es: Tiempo perdido
pt: Gasto de tempo

source: Ошибок
es: Errores
pt: Erros

source: Новых фраз
es: Nuevas frases
pt: Novas frases

source: Без подсказок
es: Sin pistas
pt: Sem dicas.

source: Повторить урок?
es: ¿Repetir la lección?
pt: Repetir a lição?

source: Подключите мотивирующие устройства
es: Conecta los dispositivos motivadores.
pt: Conecte dispositivos motivacionais.

source: Мои деньги:
es: Mis dinero:
pt: Minhas dinheiro:

source: Деньги врага:
es: El dinero del enemigo.
pt: Dinheiro do inimigo.

source: Можно забрать денег сегодня:
es: Se puede retirar el dinero hoy.
pt: Você pode retirar o dinheiro hoje.

source: Правильно:
es: Correcto:
pt: Correto:

source: Не правильно:
es: Incorrecto.
pt: Incorreto.

source: Показать
es: Mostrar
pt: Exibir

source: Произнести
es: Pronunciar
pt: Pronunciar

source: Символ
es: Símbolo
pt: Símbolo

source: Вход в систему
es: Acceso al sistema
pt: Entrada no sistema

source: Вам нужно еще одно письмо с подтверждением?
es: ¿Necesitas otra carta de confirmación?
pt: Você precisa de mais uma carta de confirmação?

source: Отмена
es: La cancelación
pt: Cancelamento
