Repository: kyiashkoievgen/HardStudy
Catalog: web/translations/*/LC_MESSAGES/messages.po
Languages: es, pt

source: Название урока
es: El nombre de la lección
pt: Título da lição

source: Тип урока
es: Tipo de clase
pt: Tipo de aula

source: Язык урока
es: Idioma de la lección
pt: Língua da aula.

source: Количество новых слов в уроке
es: La cantidad de nuevas palabras en la lección
pt: A quantidade de novas palavras na lição.

source: Всего предложений в уроке
es: Número total de oraciones en la lección.
pt: Número total de frases na lição.

source: Количество предложений для разминки
es: Número de oraciones para calentar.
pt: Número de frases para aquecimento.

source: Голос
es: Voz
pt: A voz

source: Количество повторений для новых предложений
es: La cantidad de repeticiones para nuevas oraciones.
pt: O número de repetições para novas frases

source: Количество повторений для предложений которые в процессе обучения
es: La cantidad de repeticiones para las oraciones que están en proceso de aprendizaje.
pt: Número de repetições para frases em processo de aprendizagem.

source: Количество повторений для предложений которые в повторении
es: El número de repeticiones para las oraciones que se repiten.
pt: O número de repetições para frases que se repetem.

source: Использовать диалектические знаки при вводе?
es: ¿Usar signos diacríticos al introducir?
pt: Usar sinais diacríticos ao digitar?

source: Использовать электро мотиватор
es: Usar un motivador eléctrico.
pt: Usar um motivador elétrico

source: Использовать мотивацию никотином
es: Usar la motivación con nicotina.
pt: Usar motivação com nicotina.

source: Использовать денежную мотивацию
es: Utilizar la motivación monetaria.
pt: Usar motivação financeira.

source: Сохранить настройки
es: Guardar ajustes
pt: Salvar configurações

source: Кошелек для вывода своих денег
es: Cartera para retirar tu dinero.
pt: Carteira para retirar seu dinheiro

source: Кошелек для вывода проигранных денег
es: Billetera para retirar el dinero perdido.
pt: Carteira para retirar dinheiro perdido.

source: На сколько дней распределить мотиватор?
es: ¿Por cuántos días distribuir el motivador?
pt: Por quantos dias distribuir o motivador?

source: Сколько уроков в день?
es: ¿Cuántas lecciones hay al día?
pt: Quantas aulas por dia?

source: Почта
es: Correo
pt: Correio

source: Пароль
es: Contraseña
pt: A senha

source: Оставаться в системе
es: Permanecer en el sistema.
pt: Permanecer no sistema.

source: Войти
es: Entrar
pt: Entrar

source: Имя пользователя
es: Nombre de usuario
pt: Nome de usuário

source: Пароли должны совпадать.
es: Las contraseñas deben coincidir.
pt: As senhas devem corresponder.

source: Подтвердить пароль
es: Confirmar contraseña
pt: Confirmar senha

source: Регистрация
es: Registro
pt: Registro

source: Такая почта уже зарегистрированная
es: "Este correo electrónico ya está registrado."
pt: Este e-mail já está registrado.

source: Подтвердите свою учетную запись
es: Confirme su cuenta.
pt: Confirme sua conta.

source: Подтверждение было отправлено вам по электронной почте. Подтвердите учетную запись в течение 1 часа
es: La confirmación fue enviada a su correo electrónico. Por favor, confirme su cuenta dentro de 1 hora.
pt: A confirmação foi enviada para você por e-mail. Por favor, confirme a sua conta dentro de 1 hora.

source: Неверное имя пользователя или пароль
es: Nombre de usuario o contraseña incorrectos
pt: Nome de usuário ou senha incorretos

source: Ссылка для подтверждения недействительна или срок ее действия истек.
es: El enlace de confirmación es inválido o ha caducado.
pt: O link de confirmação é inválido ou expirou.

source: Вы еще не подтвердили свою учетную запись.
es: Todavía no has confirmado tu cuenta.
pt: Você ainda não confirmou sua conta.

source: Вы должны были получить электронное письмо со ссылкой для подтверждения.
es: Deberías haber recibido un correo electrónico con un enlace de confirmación.
pt: Você deveria ter recebido um e-mail com um link para confirmação.

source: О нас
es: Sobre nosotros
pt: Sobre nós

source: Добро пожаловать на страницу "О нас" проекта Study Forge. Этот сайт является кульминацией моего личного вклада и страсти к обучению и технологиям. От идеи до дизайна и полной реализации, каждый аспект этого проекта был разработан с нуля мной, демонстрируя мою способность превращать концепции в работающие решения.
es: Bienvenido a la página "Sobre nosotros" del proyecto Study Forge. Este sitio web es el resultado de mi contribución personal y pasión por la educación y la tecnología. Desde la idea hasta el diseño y la implementación completa, cada aspecto de este proyecto ha sido desarrollado desde cero por mí, demostrando mi capacidad para convertir conceptos en soluciones funcionales.
pt: Bem-vindo à página "Sobre nós" do projeto Study Forge. Este site é o resultado do meu contributo pessoal e paixão pela educação e tecnologia. Desde a ideia até ao design e implementação completa, cada aspecto deste projeto foi desenvolvido por mim do zero, demonstrando a minha capacidade de transformar conceitos em soluções funcionais.

source: Использованные технологии
es: Tecnologías utilizadas
pt: Tecnologias utilizadas

source: Для создания Study Forge был использован широкий спектр технологий, подчеркивающих мою универсальность и знание различных инструментов разработки. Вот ключевые технологии, примененные в процессе:
es: Para crear Study Forge se utilizó una amplia gama de tecnologías que resaltan mi versatilidad y conocimiento de diversas herramientas de desarrollo. Aquí están las tecnologías clave utilizadas en el proceso:
pt: Para criar o Study Forge, foi utilizado um amplo espectro de tecnologias que destacam a minha versatilidade e conhecimento de várias ferramentas de desenvolvimento. Aqui estão as principais tecnologias aplicadas no processo:

source: Мой вклад
es: Mi contribución
pt: Meu contributo

source: Проект Study Forge отражает мою способность управлять всем процессом разработки - от первоначальной идеи до технической реализации. Я не только спроектировал архитектуру сайта и интерфейс пользователя, но и написал весь код, интегрировал базу данных и разработал сложные функции взаимодействия с пользователем с использованием ChatGPT и других технологий.
es: El proyecto Study Forge refleja mi capacidad para manejar todo el proceso de desarrollo, desde la idea inicial hasta la implementación técnica. No solo diseñé la arquitectura del sitio y la interfaz de usuario, sino que también escribí todo el código, integré la base de datos y desarrollé funciones complejas de interacción con el usuario utilizando ChatGPT y otras tecnologías.
pt: O projeto Study Forge reflete minha capacidade de gerenciar todo o processo de desenvolvimento - desde a ideia inicial até a implementação técnica. Não só projetei a arquitetura do site e a interface do usuário, mas também escrevi todo o código, integrei o banco de dados e desenvolvi funções complexas de interação com o usuário usando o ChatGPT e outras tecnologias.

source: Важным этапом разработки стало тестирование созданной методики на себе. Этот процесс не только позволил мне убедиться в эффективности и надежности системы, но и продемонстрировал удивительные результаты. Использование методики Study Forge значительно улучшило мои навыки владения иностранными языками и программированием, подтверждая потенциал методики для обучения и развития.
es: Un paso importante en el desarrollo fue probar la metodología creada en uno mismo. Este proceso no solo me permitió confirmar la eficacia y fiabilidad del sistema, sino que también demostró resultados sorprendentes. El uso de la metodología Study Forge mejoró significativamente mis habilidades en idiomas extranjeros y programación, confirmando el potencial de la metodología para la educación y el desarrollo.
pt: Um passo importante no desenvolvimento foi testar a metodologia criada em si mesma. Esse processo não apenas me permitiu confirmar a eficácia e confiabilidade do sistema, mas também demonstrou resultados surpreendentes. A utilização da metodologia Study Forge melhorou significativamente minhas habilidades em idiomas estrangeiros e programação, confirmando o potencial da metodologia para ensino e desenvolvimento.

source: Этот сайт служит не только платформой для обучения, но и моим портфолио, демонстрируя мои навыки и опыт потенциальным клиентам. Я горжусь тем, что могу представить методику Study Forge как пример моей работы, отражающий мою страсть к разработке и обучению.
es: Este sitio no solo sirve como plataforma de aprendizaje, sino también como mi portafolio, mostrando mis habilidades y experiencia a posibles clientes. Estoy orgulloso de poder presentar la metodología de Study Forge como un ejemplo de mi trabajo, reflejando mi pasión por el desarrollo y la enseñanza.
pt: Este site não só serve como uma plataforma de aprendizado, mas também como meu portfólio, demonstrando minhas habilidades e experiência para potenciais clientes. Estou orgulhoso de poder apresentar a metodologia do Study Forge como um exemplo do meu trabalho, refletindo minha paixão pelo desenvolvimento e ensino.

source: Добро пожаловать на Study Forge
es: Bienvenido a Study Forge.
pt: Bem-vindo ao Study Forge.

source: Study Forge революционный подход к изучению иностранных языков и языков программирования
es: Estudio Forge es un enfoque revolucionario para el estudio de idiomas extranjeros y lenguajes de programación.
pt: Estudo Forge é uma abordagem revolucionária para aprender línguas estrangeiras e linguagens de programação.

source: Добро пожаловать на Study Forge – революционный подход к изучению иностранных языков и языков программирования, который обещает не только улучшить ваше владение новым языком, но и радикально изменить ваше восприятие процесса обучения. Забудьте о традиционных методиках, которые полагаются исключительно на зубрежку и пассивное восприятие информации. Study Forge вносит инновации в процесс обучения, активизируя все ваши чувства для создания мощных и долговременных нейронных связей.
es: Bienvenido a Study Forge: un enfoque revolucionario para el estudio de idiomas extranjeros y lenguajes de programación, que promete no solo mejorar tu dominio de un nuevo idioma, sino también cambiar radicalmente tu percepción del proceso de aprendizaje. Olvídate de los métodos tradicionales que se basan únicamente en la memorización y la percepción pasiva de la información. Study Forge introduce innovaciones en el proceso de aprendizaje, activando todos tus sentidos para crear conexiones neuronales potentes y duraderas.
pt: Bem-vindo ao Study Forge - uma abordagem revolucionária para aprender idiomas estrangeiros e linguagens de programação, que promete não apenas melhorar o seu domínio de um novo idioma, mas também mudar radicalmente a sua percepção do processo de aprendizagem. Esqueça os métodos tradicionais que dependem exclusivamente de memorização e percepção passiva da informação. O Study Forge traz inovações ao processo de aprendizagem, ativando todos os seus sentidos para criar conexões neurais poderosas e duradouras.

source: Наш уникальный метод объединяет слепой набор на клавиатуре с изучением новых слов и грамматических конструкций, позволяя вам взаимодействовать с новым языком на более глубоком уровне. Представьте себе: каждое нажатие клавиш – это не просто механическое действие, а шаг к укреплению вашего понимания и запоминания нового языка. С помощью Study Forge вы не только научитесь понимать и говорить на новом языке, но и освоите слепой метод набора текста, что значительно повысит вашу продуктивность в работе и повседневной жизни.Наш уникальный метод объединяет слепой набор на клавиатуре с изучением новых слов и грамматических конструкций, позволяя вам взаимодействовать с новым языком на более глубоком уровне.
es: Nuestro método único combina la mecanografía a ciegas con el aprendizaje de nuevas palabras y estructuras gramaticales, lo que le permite interactuar con un nuevo idioma a un nivel más profundo. Imagínese: cada pulsación de tecla no es solo una acción mecánica, sino un paso hacia fortalecer su comprensión y memorización del nuevo idioma. Con la ayuda de Study Forge, no solo aprenderá a comprender y hablar en un nuevo idioma, sino que también dominará la técnica de mecanografía a ciegas, lo que mejorará significativamente su productividad en el trabajo y en la vida cotidiana.
pt: Nosso método exclusivo combina digitação cega no teclado com o aprendizado de novas palavras e estruturas gramaticais, permitindo que você interaja com o novo idioma em um nível mais profundo. Imagine: cada tecla pressionada não é apenas uma ação mecânica, mas sim um passo para fortalecer sua compreensão e memorização do novo idioma. Com o Study Forge, você não apenas aprenderá a entender e falar em um novo idioma, mas também dominará a digitação cega, o que aumentará significativamente sua produtividade no trabalho e na vida cotidiana.

source: Мы верим, что обучение должно быть максимально эффективным и в то же время вдохновляющим. Именно поэтому Study Forge включает в себя систему поощрений и наказаний, которая мотивирует вас двигаться вперед, даже когда это кажется сложным. От физической стимуляции для закрепления правильных ответов до наград за каждый успешный шаг в вашем обучении – мы создали среду, где каждое усилие приносит заслуженные плоды.
es: Creemos que la educación debe ser lo más efectiva posible y al mismo tiempo inspiradora. Es por eso que Study Forge incluye un sistema de recompensas y castigos que te motiva a seguir adelante, incluso cuando parece difícil. Desde la estimulación física para reforzar las respuestas correctas hasta premios por cada paso exitoso en tu aprendizaje, hemos creado un entorno donde cada esfuerzo da sus frutos.
pt: Acreditamos que a educação deve ser o mais eficaz possível e, ao mesmo tempo, inspiradora. É por isso que o Study Forge inclui um sistema de recompensas e punições que o motiva a avançar, mesmo quando parece difícil. Desde a estimulação física para reforçar as respostas corretas até recompensas por cada passo bem-sucedido em sua aprendizagem - criamos um ambiente onde cada esforço traz frutos merecidos.

source: Присоединяйтесь к нам на Study Forge и откройте для себя новый, более глубокий способ изучения языков, который не только обогатит ваш ум, но и пробудит все ваши чувства. Приготовьтесь к путешествию, где каждый шаг ведет к открытию, а каждый успех – к новому уровню владения языком и понимания технологий.
es: Únete a nosotros en Study Forge y descubre una nueva forma más profunda de aprender idiomas, que no solo enriquecerá tu mente, sino que también despertará todos tus sentidos. Prepárate para un viaje donde cada paso te lleva a nuevas revelaciones, y cada éxito te lleva a un nuevo nivel de dominio del idioma y comprensión de la tecnología.
pt: Junte-se a nós no Study Forge e descubra uma nova maneira mais profunda de aprender idiomas, que não só enriquecerá sua mente, mas também despertará todos os seus sentidos. Prepare-se para uma jornada onde cada passo leva a uma descoberta e cada sucesso leva a um novo nível de domínio da língua e compreensão de tecnologias.

source: Как это работает: Углубленный взгляд на методику Study Forge
es: Cómo funciona: Un análisis detallado de la metodología Study Forge
pt: Como funciona: Uma visão aprofundada da metodologia Study Forge

source: Методика Study Forge представляет собой инновационный подход к изучению языков и программирования, который активно задействует все ваши чувства для максимального усвоения материала. Вот как мы делаем обучение более эффективным и запоминающимся:
es: La metodología Study Forge es un enfoque innovador para el aprendizaje de idiomas y programación que involucra activamente todos tus sentidos para una máxima asimilación del material. Así es como hacemos que el aprendizaje sea más efectivo y memorable.
pt: A metodologia do Study Forge é uma abordagem inovadora para o estudo de idiomas e programação, que envolve ativamente todos os seus sentidos para uma máxima absorção do material. Aqui está como tornamos o aprendizado mais eficaz e memorável:

source: Слепой набор с использованием моторики
es: Escritura a ciegas utilizando la motricidad.
pt: Digitação cega com uso de motricidade.

source: Основой Study Forge является принцип слепого набора, который не только улучшает вашу способность к слепому вводу текста, но и способствует глубокому запоминанию новых слов и фраз. Набирая текст, не глядя на клавиатуру, вы активизируете моторные и визуальные центры в мозге, что способствует формированию более крепких нейронных связей между словом и его значением.
es: La base de Study Forge es el principio de mecanografía a ciegas, que no solo mejora tu habilidad para escribir a ciegas, sino que también favorece la memorización profunda de nuevas palabras y frases. Al escribir texto sin mirar el teclado, activas los centros motores y visuales en el cerebro, lo que contribuye a formar conexiones neuronales más sólidas entre la palabra y su significado.
pt: A base do Study Forge é o princípio da digitação cega, que não só melhora a sua habilidade de digitar sem olhar para o teclado, mas também promove a memorização profunda de novas palavras e frases. Ao digitar o texto sem olhar para o teclado, você ativa os centros motores e visuais do cérebro, o que contribui para a formação de conexões neurais mais fortes entre a palavra e seu significado.

source: Звуковое восприятие и визуальные ассоциации
es: Percepción auditiva y asociaciones visuales
pt: Percepção sonora e associações visuais

source: Каждый урок в Study Forge сопровождается аудиовизуальными материалами. Вы слышите, как произносится каждое слово или фраза, и видите соответствующие изображения или ситуации, которые помогают укрепить ваше понимание и запоминание. Это не просто улучшает ваше звуковое восприятие языка, но и обогащает ваше воображение, помогая лучше запоминать новую лексику.
es: Cada lección en Study Forge viene acompañada de materiales audiovisuales. Escuchas cómo se pronuncia cada palabra o frase, y ves las imágenes o situaciones correspondientes que ayudan a fortalecer tu comprensión y memorización. Esto no solo mejora tu percepción auditiva del idioma, sino que también enriquece tu imaginación, ayudándote a recordar mejor el nuevo vocabulario.
pt: Cada lição no Study Forge é acompanhada por materiais audiovisuais. Você ouve como cada palavra ou frase é pronunciada e vê imagens ou situações correspondentes que ajudam a fortalecer sua compreensão e memorização. Isso não apenas melhora sua percepção auditiva do idioma, mas também enriquece sua imaginação, ajudando a memorizar melhor o novo vocabulário.

source: Система поощрений и наказаний
es: Sistema de recompensas y castigos
pt: Sistema de recompensas e punições

source: Чтобы мотивировать вас на успех, Study Forge использует комплексную систему поощрений и наказаний. Это включает в себя:
es: Para motivarte hacia el éxito, Study Forge utiliza un sistema integral de recompensas y castigos. Esto incluye:
pt: Para motivá-lo para o sucesso, o Study Forge utiliza um sistema abrangente de recompensas e punições. Isso inclui:

source: Физическая стимуляция:
es: Estimulación física.
pt: Estimulação física:

source: Небольшие электрические разряды от браслета при ошибке помогают закрепить правильные ответы на физиологическом уровне.
es: Pequeñas descargas eléctricas del brazalete en caso de error ayudan a fijar las respuestas correctas a nivel fisiológico.
pt: Pequenas descargas elétricas do bracelete em caso de erro ajudam a fixar as respostas corretas a nível fisiológico.

source: Никотиновые награды:
es: Recompensas de nicotina.
pt: Recompensas de nicotina.

source: Временное разрешение на курение электронной сигареты за правильные ответы использует никотиновую стимуляцию для улучшения запоминания.
es: La autorización temporal para fumar cigarrillos electrónicos por respuestas correctas utiliza la estimulación de nicotina para mejorar la memoria.
pt: A permissão temporária para fumar cigarros eletrônicos por respostas corretas utiliza a estimulação de nicotina para melhorar a memória.

source: Финансовые поощрения:
es: Incentivos financieros.
pt: Incentivos financeiros:

source: Система денежных наград и штрафов, включая возможность зарабатывать или терять деньги в зависимости от успехов в обучении, стимулирует продолжать обучение и достигать лучших результатов.
es: El sistema de recompensas y multas monetarias, que incluye la posibilidad de ganar o perder dinero dependiendo del éxito en el aprendizaje, estimula a continuar estudiando y lograr mejores resultados.
pt: O sistema de recompensas e penalidades financeiras, incluindo a possibilidade de ganhar ou perder dinheiro dependendo do sucesso nos estudos, estimula a continuação da aprendizagem e a obtenção de melhores resultados.

source: Уроки и прогресс
es: Lecciones y progreso.
pt: Lições e progresso

source: Уроки в Study Forge разработаны так, чтобы постепенно увеличивать сложность и вариативность материалов, от простых предложений до сложных диалогов. Ваш прогресс отслеживается через систему счётчиков правильных ответов, что позволяет адаптировать учебный план под ваши индивидуальные потребности и скорость обучения.
es: Las lecciones en Study Forge están diseñadas para aumentar gradualmente la complejidad y variedad de los materiales, desde frases simples hasta diálogos complejos. Tu progreso se monitorea a través de un sistema de contadores de respuestas correctas, lo que permite adaptar el plan de estudios a tus necesidades individuales y velocidad de aprendizaje.
pt: As lições no Study Forge foram desenvolvidas para gradualmente aumentar a complexidade e variedade dos materiais, desde frases simples até diálogos complexos. Seu progresso é acompanhado através de um sistema de contadores de respostas corretas, o que permite adaptar o plano de estudos às suas necessidades individuais e velocidade de aprendizagem.

source: Присоединяйтесь к нам на Study Forge, чтобы испытать на себе преимущества нашей уникальной методики. Откройте для себя новый способ изучения языков, который делает процесс обучения не только эффективным, но и захватывающим.
es: Únete a nosotros en Study Forge para experimentar los beneficios de nuestra metodología única. Descubre una nueva forma de aprender idiomas que hace que el proceso de aprendizaje no solo sea efectivo, sino también emocionante.
pt: Junte-se a nós na Study Forge para experimentar os benefícios de nossa metodologia única. Descubra uma nova maneira de aprender idiomas que torna o processo de aprendizagem não apenas eficaz, mas também empolgante.

source: Преимущества Study Forge
es: Ventajas de Study Forge
pt: Vantagens do Study Forge

source: Методика Study Forge предлагает ряд преимуществ, делающих ее одной из самых инновационных и эффективных систем обучения на сегодняшний день. Вот почему выбор Study Forge — это выбор в пользу качества и результативности:
es: La metodología de Study Forge ofrece una serie de ventajas que la convierten en uno de los sistemas de aprendizaje más innovadores y efectivos en la actualidad. Por eso, elegir Study Forge es elegir la calidad y la efectividad.
pt: A metodologia Study Forge oferece uma série de vantagens que a tornam um dos sistemas de ensino mais inovadores e eficazes nos dias de hoje. Por isso, escolher o Study Forge é escolher a qualidade e a eficácia.

source: Улучшенная эффективность запоминания
es: Mejora de la eficiencia de la memoria.
pt: Melhoria na eficiência da memorização.
